/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_len.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/17 17:03:36 by tchariss          #+#    #+#             */
/*   Updated: 2021/01/19 16:35:06 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
// выводим символ 
// чтобы выводить пустые строчки с конца
int		ft_putchar_len(char c, int len)
{
	int i;

	i = len;
	while (len > 0)
	{
		write(1, &c, 1);
		len--;
	}
	return (i);
}