/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   putchar_putstr.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/17 17:03:36 by tchariss          #+#    #+#             */
/*   Updated: 2021/01/18 13:45:03 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
// выводим символ 
int	ft_putchar(char c)
{
	write(1, &c, 1);
}
// выводим строку
int	ft_putstr(char *s)
{
	int num;

	num = 0;
	if (s == NULL)
		return (NULL);
	while (*s)
	{ // будем записывать в num по одному символу за раз
		num += ft_putchar(*s);
		s++;
	}
}
